## 판다스

In [230]:
# 데이터를 조작/분석하기위한 라이브러리임.
# 다양한 데이터 분석 함수를 제공힘.
# 행과 열로 이루어진 객체를 만들고 다룰 수 있음 - ? 3차원의 데이터는 다룰 수 없나?
# 판다스의 데이터 구조는 시리즈와 데이터 프레임이 있음.

### 시리즈

In [231]:
# 시리즈는 1차원 배열의 형태로 한가지 형의 데이터로 구성되며, 인덱스는 특별히 지정하지 않으면 숫자 0부터 시작함.
# 보통 인덱스는 문자로 지정함.

### 데이터 프레임

In [232]:
# 2차원 배열의 형태로 이루어진 데이터 구조임(엑셀과 비슷함).
# 인덱스와 컬럼이라는 두 가지 기준에 의해 표와 같이 데이터가 저장됨.
# 시리즈가 합쳐진 형태임.
# 데이터 프레임은 이중리스트나 딕셔러니로 만들 수 있음.
# 딕셔너리로 데이터 프레임을 만들면 키(key value)가 컬럼 명으로 지정되어 만들어짐.

In [233]:
# df.columns = 컬럼명 확인
# df.columns = ['컬럼명 1','컬럼명 2','컬럼명 3','컬럼명 4']

In [234]:
# 데이터 파일: CSV
# 하나의 파일로 관리 가능한 크기의 데이터라면 일반적으로 csv포맷을 활용함.
# 데이터가 콤마로 분리되어 저장.
# 한글이 포함된 경우 인코딩 방식을 utf8로 해야지 한글이 깨지지 않음.
# 데이터 파일의 이름을 적어줄 때 같은 폴더 안에 위치 하지 않는다면, 경로명까지 정확히 적어야함.
# CSV파일을 읽어서 데이터프레임 객체로 만들어서 반환함. (보통 df라는 변수명을 사용함)

In [235]:
# 분석 절차
# 1. 데이터 정보 확인 = 행과 열의 크기 컬럼명, 컬럼을 구성하는 값의 자료형 등을 요약하여 정보를 출력함.
# ex) 데이터 프레임명.info()
# 2. 칼럼별 통계량 = 숫자형 변수에 대한 기초 통계량을 출력함.
# ex) 데이터프레임명.describe()
# 3. 데이터

## Pandas

In [1]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.23.2 (from pandas)
  Downloading numpy-2.4.1-cp311-cp311-win_amd64.whl.metadata (6.6 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
    --------------------------------------- 0.2/11.3 MB 6.1 MB/s eta 0:00:02
   -- ------------------------------------- 0.7/11.3 MB 8.3 MB/s eta 0:00:02
   ---- ----------------------------------- 1.2/11.3 MB 9.4 MB/s eta 0:00:02
   ------ --------------------------------- 1.9/11.3 MB 11.1 MB/s eta 0:00:01
   ---------- ----------------------------- 3.0/11.3 MB 13.8 MB/s eta 0:00:01
   --------------- ------------------------ 4.5/11.3 MB 17.0 MB/s eta 0:00:01
   ----------------------- ---------------- 6.5/11.3 MB 20.9 MB/s eta 0:00:01
   --------------------------------- ------ 9.5/11.3 MB 26.3 MB/s eta 0:00:01
   ---------------------------------------- 11.3/11.3 MB 36.2 MB/s eta 0:00:00
Downloading numpy-2.4.1-cp311-cp311-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ------------- -------------------------- 4.2/12.6 MB 134.4 MB/s eta 0:00:01
   --------------------------- ------------ 8.6/12.6 MB 109.5 MB/s eta 0:00:01
   ---------------------------------------  12.6/12.6 MB 93.9 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 81.8 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
   ---------------------------------------- 0.0/509.2 kB ? eta -:--:--
   --------------------------------------- 509.2/509.2 kB 33.3 MB/s eta 0:00:00
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
   ---------------------------------------- 0.0/348.5 kB ? eta -:--:--
   --------------------------------------- 348.5/348.5 kB 21.1 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.4.1 pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
import pandas as pd

In [6]:
pd.__version__

'2.3.3'

In [239]:
df = pd.read_csv('heroes.csv')
df

      이름  나이     직업     국적    키             재산
0   아이언맨  58    CEO     미국  174 11500000000.00
1     토르  45      신  아스가르드  190            NaN
2  스파이더맨  18   고등학생     미국  177         600.00
3   원더우먼  27     공주  데미스키라  178            NaN
4     헐크  33  핵물리학자     미국  270  1000000000.00
5   캡틴마블  25    파일럿     미국  170   340000000.00
6  블랙위도우  32    스파이    러시아  170    50000000.00

In [240]:
pd.options.display.float_format = '{:.0f}'.format

In [241]:
df

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [242]:
df.head()

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000

In [243]:
df.tail()

      이름  나이     직업     국적    키         재산
2  스파이더맨  18   고등학생     미국  177        600
3   원더우먼  27     공주  데미스키라  178        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
5   캡틴마블  25    파일럿     미국  170  340000000
6  블랙위도우  32    스파이    러시아  170   50000000

In [244]:
df.sample(3)

      이름  나이    직업     국적    키       재산
1     토르  45     신  아스가르드  190      NaN
6  블랙위도우  32   스파이    러시아  170 50000000
2  스파이더맨  18  고등학생     미국  177      600

In [245]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [246]:
df.describe()

       나이   키          재산
count   7   7           5
mean   34 190  2578000120
std    13  36  5003440739
min    18 170         600
25%    26 172    50000000
50%    32 177   340000000
75%    39 184  1000000000
max    58 270 11500000000

In [247]:
df.head()

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000

In [248]:
df['국적'].unique()

array(['미국', '아스가르드', '데미스키라', '러시아'], dtype=object)

In [249]:
df['국적'].value_counts()

국적
미국       4
아스가르드    1
데미스키라    1
러시아      1
Name: count, dtype: int64

In [250]:
df['나이'].nlargest()

0    58
1    45
4    33
6    32
3    27
Name: 나이, dtype: int64

In [251]:
df.nlargest(5,'나이')

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000
3   원더우먼  27     공주  데미스키라  178         NaN

In [252]:
# 미션
# 키가 큰 순서대로 7명을 정렬
df.nlargest(7, '키')

      이름  나이     직업     국적    키          재산
4     헐크  33  핵물리학자     미국  270  1000000000
1     토르  45      신  아스가르드  190         NaN
3   원더우먼  27     공주  데미스키라  178         NaN
2  스파이더맨  18   고등학생     미국  177         600
0   아이언맨  58    CEO     미국  174 11500000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [253]:
# 데이터 일부분 선택

In [254]:
df[['이름', '직업']]

      이름     직업
0   아이언맨    CEO
1     토르      신
2  스파이더맨   고등학생
3   원더우먼     공주
4     헐크  핵물리학자
5   캡틴마블    파일럿
6  블랙위도우    스파이

In [255]:
df['이름'][0:5]

0     아이언맨
1       토르
2    스파이더맨
3     원더우먼
4       헐크
Name: 이름, dtype: object

In [256]:
df[:3]

      이름  나이    직업     국적    키          재산
0   아이언맨  58   CEO     미국  174 11500000000
1     토르  45     신  아스가르드  190         NaN
2  스파이더맨  18  고등학생     미국  177         600

In [257]:
# df.iloc() = 순서(정수)로 데이터를 검색
# ex) df.iloc[행번호, 열번]
# df.loc() = 이름(label)로 데이터 검색
# ex) df.loc[인덱스명, 칼럼명]

In [258]:
df.iloc[[1,3,6]]

      이름  나이   직업     국적    키       재산
1     토르  45    신  아스가르드  190      NaN
3   원더우먼  27   공주  데미스키라  178      NaN
6  블랙위도우  32  스파이    러시아  170 50000000

In [259]:
df.loc[[0,4,6]]

      이름  나이     직업   국적    키          재산
0   아이언맨  58    CEO   미국  174 11500000000
4     헐크  33  핵물리학자   미국  270  1000000000
6  블랙위도우  32    스파이  러시아  170    50000000

In [260]:
df.loc[2:5]

      이름  나이     직업     국적    키         재산
2  스파이더맨  18   고등학생     미국  177        600
3   원더우먼  27     공주  데미스키라  178        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
5   캡틴마블  25    파일럿     미국  170  340000000

In [261]:
df.loc[0:2, ['이름','직업']]

      이름    직업
0   아이언맨   CEO
1     토르     신
2  스파이더맨  고등학생

In [262]:
# 팬시(불린) 인덱싱
# 나이가 30살 이상인 레코드 추출

df.loc[df['나이'] >= 30]

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [263]:
# 미션
# 나이가 30 초과 50인 레코드만 추출

df.loc[(df['나이'] > 30) & (df['나이'] < 50)]

      이름  나이     직업     국적    키         재산
1     토르  45      신  아스가르드  190        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
6  블랙위도우  32    스파이    러시아  170   50000000

In [264]:
# 미션
# 키가 180이상인 레코드의 이름과 나이 컬럼만 출력
df.loc[(df['키'] > 180), ['이름', '나이']]

   이름  나이
1  토르  45
4  헐크  33

In [265]:
df['전투력'] = [90,60,70,51,100,0,55]
df

      이름  나이     직업     국적    키          재산  전투력
0   아이언맨  58    CEO     미국  174 11500000000   90
1     토르  45      신  아스가르드  190         NaN   60
2  스파이더맨  18   고등학생     미국  177         600   70
3   원더우먼  27     공주  데미스키라  178         NaN   51
4     헐크  33  핵물리학자     미국  270  1000000000  100
5   캡틴마블  25    파일럿     미국  170   340000000    0
6  블랙위도우  32    스파이    러시아  170    50000000   55

In [266]:
df.rename(columns = {'이름':'성명', '나이':'연령'}, inplace=True)
# or  df = df.rename(columns = {'이름':'성명', '나이':'연령'}, inplace=True) 와 같이 할당을 해야지 원본데이터가 변경됨

In [267]:
df.drop(columns=['전투력'], inplace=True)

In [268]:
df[df['재산'].isnull()]

     성명  연령  직업     국적    키  재산
1    토르  45   신  아스가르드  190 NaN
3  원더우먼  27  공주  데미스키라  178 NaN

In [269]:
df.isnull().sum()

성명    0
연령    0
직업    0
국적    0
키     0
재산    2
dtype: int64

In [270]:
df.dropna()

      성명  연령     직업   국적    키          재산
0   아이언맨  58    CEO   미국  174 11500000000
2  스파이더맨  18   고등학생   미국  177         600
4     헐크  33  핵물리학자   미국  270  1000000000
5   캡틴마블  25    파일럿   미국  170   340000000
6  블랙위도우  32    스파이  러시아  170    50000000

In [271]:
df

      성명  연령     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [272]:
df['재산'].fillna(2578000120)

0   11500000000
1    2578000120
2           600
3    2578000120
4    1000000000
5     340000000
6      50000000
Name: 재산, dtype: float64

In [273]:
df['재산'].mean()

np.float64(2578000120.0)

In [274]:
# 결측치를 이전 혹은 이후의 값으로 채우는 함수
# df.ffill()
# df.fillna(method='f(or b)fill')

In [275]:
df

      성명  연령     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
5   캡틴마블  25    파일럿     미국  170   340000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [276]:
def add_cm(height):
    return str(height) + 'cm'

df['키'].apply(add_cm)

0    174cm
1    190cm
2    177cm
3    178cm
4    270cm
5    170cm
6    170cm
Name: 키, dtype: object

In [277]:
df.groupby('국적')['연령'].mean()

국적
데미스키라   27
러시아     32
미국      34
아스가르드   45
Name: 연령, dtype: float64

In [278]:
# 미션
# sales, user 두 가지 다 로드할 것 
import pandas as pd
import numpy as np



sales_df = pd.read_csv('sales_data.csv')
user_df = pd.read_csv('user_data.csv')
pd.options.display.float_format = '{:.2f}'.format

In [279]:
sales_df

  customer_id  order_date product_category   amount channel  discount_rate
0        C001  2025-09-01               가전  1200000     온라인           0.10
1        C002  2025-09-01             주방용품    45000    오프라인           0.05
2        C003  2025-09-02              식료품    12000     온라인            NaN
3        C001  2025-09-02               의류    89000     온라인           0.15
4        C004  2025-09-03             주방용품    21000     온라인           0.00
5        C002  2025-09-03               가전  2500000    오프라인           0.05
6        C005  2025-09-04               도서     9900     온라인           0.00
7        C003  2025-09-04             주방용품    62000    오프라인            NaN
8        C001  2025-09-05              식료품     8500     온라인           0.00
9        C004  2025-09-05               의류   150000     온라인           0.20

In [280]:
user_df

  customer_id customer_name region
0        C001           김민준     서울
1        C002           이서연     부산
2        C003           박도윤     인천
3        C004           최지우     서울
4        C005           정하은     광주

In [281]:
# 컬럼명을 한글로 변경
# '고객ID', '구매일자', '제품분류', '구매금액', '구매채널', '할인율'
# '고객ID', '고객명', '가입지역'
#sales_df = sales_df.rename(columns = {'customer_id':'고객 ID', 'order_date':'주문일자', 
#						   'product_category':'제품분류', 'amount':'구매금액','channel':'구매채널',
#                           'discount_rate':'할인율'})
#user_df = user_df.rename(columns= {'customer_id':'고객ID', 'customer_name': '고객명',
#						 'region': '지역'},)		
sales_df.columns = ['고객ID', '구매일자', '제품분류', '구매금액', '구매채널', '할인율']
user_df.columns = ['고객ID', '고객명', '가입지역']

In [282]:
sales_df

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
2  C003  2025-09-02   식료품    12000   온라인  NaN
3  C001  2025-09-02    의류    89000   온라인 0.15
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
6  C005  2025-09-04    도서     9900   온라인 0.00
7  C003  2025-09-04  주방용품    62000  오프라인  NaN
8  C001  2025-09-05   식료품     8500   온라인 0.00
9  C004  2025-09-05    의류   150000   온라인 0.20

In [283]:
# 구매금액이 10000원 이상인 데이터만 필터링
sales_df[sales_df['구매금액'] > 10000]

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
2  C003  2025-09-02   식료품    12000   온라인  NaN
3  C001  2025-09-02    의류    89000   온라인 0.15
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
7  C003  2025-09-04  주방용품    62000  오프라인  NaN
9  C004  2025-09-05    의류   150000   온라인 0.20

In [284]:
# '온라인' 채널에서 발생한 구매 중 5000원 이상인 것만 필터링
sales_df.loc[(sales_df['구매금액'] > 5000) & (sales_df['구매채널'] == '온라인')]

   고객ID        구매일자  제품분류     구매금액 구매채널  할인율
0  C001  2025-09-01    가전  1200000  온라인 0.10
2  C003  2025-09-02   식료품    12000  온라인  NaN
3  C001  2025-09-02    의류    89000  온라인 0.15
4  C004  2025-09-03  주방용품    21000  온라인 0.00
6  C005  2025-09-04    도서     9900  온라인 0.00
8  C001  2025-09-05   식료품     8500  온라인 0.00
9  C004  2025-09-05    의류   150000  온라인 0.20

In [285]:
# '가전', '주방용품' 에 속하는 데이터만 필터링
#sales_df.loc[(sales_df['제품분류'] == '가전') | (sales_df['제품분류'] == '주방용품')] = 가짓수 적을때
sales_df[sales_df['제품분류'].isin(['가전', '주방용품'])] # 가짓수가 많을때

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
7  C003  2025-09-04  주방용품    62000  오프라인  NaN

In [286]:
# 각 열별 결측치 개수 확인
sales_df.isnull().sum()

고객ID    0
구매일자    0
제품분류    0
구매금액    0
구매채널    0
할인율     2
dtype: int64

In [287]:
# 결측치가 있는 행 전체 삭제
sales_df.dropna()

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
3  C001  2025-09-02    의류    89000   온라인 0.15
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
6  C005  2025-09-04    도서     9900   온라인 0.00
8  C001  2025-09-05   식료품     8500   온라인 0.00
9  C004  2025-09-05    의류   150000   온라인 0.20

In [288]:
# 특정 값으로 결측치 채우기
# sales_df = sales_df.fillna(method='ffill')
sales_df['할인율'] = sales_df['할인율'].fillna(0)

In [289]:
sales_df

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
2  C003  2025-09-02   식료품    12000   온라인 0.00
3  C001  2025-09-02    의류    89000   온라인 0.15
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
6  C005  2025-09-04    도서     9900   온라인 0.00
7  C003  2025-09-04  주방용품    62000  오프라인 0.00
8  C001  2025-09-05   식료품     8500   온라인 0.00
9  C004  2025-09-05    의류   150000   온라인 0.20

In [290]:
# 기존 열을 이용해 새로운 열 생성 
# 할인률이 적용된 df['실구매금액'] 새롭게 생성
sales_df['실구매금액'] = sales_df['구매금액'] * (1 - sales_df['할인율'])
sales_df

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율      실구매금액
0  C001  2025-09-01    가전  1200000   온라인 0.10 1080000.00
1  C002  2025-09-01  주방용품    45000  오프라인 0.05   42750.00
2  C003  2025-09-02   식료품    12000   온라인 0.00   12000.00
3  C001  2025-09-02    의류    89000   온라인 0.15   75650.00
4  C004  2025-09-03  주방용품    21000   온라인 0.00   21000.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05 2375000.00
6  C005  2025-09-04    도서     9900   온라인 0.00    9900.00
7  C003  2025-09-04  주방용품    62000  오프라인 0.00   62000.00
8  C001  2025-09-05   식료품     8500   온라인 0.00    8500.00
9  C004  2025-09-05    의류   150000   온라인 0.20  120000.00

In [ ]:
# 고객 등급을 'VIP'와 '일반'으로 나누기(구매금액이 10000 이상이면 VIP)
sales_df['고객등급'] = sales_df['구매금액'].apply(lambda x: 'VIP' if x >= 10000 else '일반')

In [ ]:
# 제품분류별 구매금액의 평균 구하기
print("8 & 9. 실구매금액 및 고객등급 생성:")
print(sales_df[['구매금액', '할인율', '실구매금액', '고객등급']].head())
print("-" * 30)

8 & 9. 실구매금액 및 고객등급 생성:
      구매금액  할인율      실구매금액 고객등급
0  1200000 0.10 1080000.00  VIP
1    45000 0.05   42750.00  VIP
2    12000 0.00   12000.00  VIP
3    89000 0.15   75650.00  VIP
4    21000 0.00   21000.00  VIP
------------------------------

In [ ]:
# 구매채널별로 그룹화하여, 구매금액의 총합과 평균 동시 구하기
channel_stats = sales_df.groupby('구매채널')['구매금액'].agg(['sum', 'mean'])
print("\n11. 구매채널별 구매금액 총합 및 평균:")
print(channel_stats)

In [296]:
merged_df = pd.merge(sales_df, user_df, on='고객ID')

In [297]:
merged_df

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율      실구매금액 고객등급  고객명 가입지역
0  C001  2025-09-01    가전  1200000   온라인 0.10 1080000.00  VIP  김민준   서울
1  C002  2025-09-01  주방용품    45000  오프라인 0.05   42750.00  VIP  이서연   부산
2  C003  2025-09-02   식료품    12000   온라인 0.00   12000.00  VIP  박도윤   인천
3  C001  2025-09-02    의류    89000   온라인 0.15   75650.00  VIP  김민준   서울
4  C004  2025-09-03  주방용품    21000   온라인 0.00   21000.00  VIP  최지우   서울
5  C002  2025-09-03    가전  2500000  오프라인 0.05 2375000.00  VIP  이서연   부산
6  C005  2025-09-04    도서     9900   온라인 0.00    9900.00   일반  정하은   광주
7  C003  2025-09-04  주방용품    62000  오프라인 0.00   62000.00  VIP  박도윤   인천
8  C001  2025-09-05   식료품     8500   온라인 0.00    8500.00   일반  김민준   서울
9  C004  2025-09-05    의류   150000   온라인 0.20  120000.00  VIP  최지우   서울

In [298]:
merged_df.to_csv('merged_sales_user_data.csv', index=False, encoding='utf-8-sig')

## Matplotlib

In [7]:
%pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.10.8-cp311-cp311-win_amd64.whl.metadata (52 kB)
     ---------------------------------------- 0.0/52.8 kB ? eta -:--:--
     -------------- ----------------------- 20.5/52.8 kB 330.3 kB/s eta 0:00:01
     -------------------------------------- 52.8/52.8 kB 687.0 kB/s eta 0:00:00
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.3-cp311-cp311-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.61.1-cp311-cp311-win_amd64.whl.metadata (116 kB)
     ---------------------------------------- 0.0/116.4 kB ? eta -:--:--
     -------------------------------------- 116.4/116.4 kB 6.6 MB/s eta 0:00:00
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.9-cp311-cp311-win_amd64.whl.metadata (6.4 kB)
Requirement already satisfied: numpy>=1.23 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib) (2.4.1)
Requirement already satisfied: packaging>=20.0 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from matplotlib) (25.0)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-12.1.0-cp311-cp311-win_amd64.whl.metadata (9.0 kB)
Collecting pyparsing>=3 (from matplotlib)
  Downloading pyparsing-3.3.1-py3-none-any.whl.metadata (5.6 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.8-cp311-cp311-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   --- ------------------------------------ 0.6/8.1 MB 19.5 MB/s eta 0:00:01
   ------- -------------------------------- 1.6/8.1 MB 16.7 MB/s eta 0:00:01
   --------------- ------------------------ 3.1/8.1 MB 22.2 MB/s eta 0:00:01
   -------------------- ------------------- 4.2/8.1 MB 24.3 MB/s eta 0:00:01
   -------------------- ------------------- 4.2/8.1 MB 24.3 MB/s eta 0:00:01
   -------------------- ------------------- 4.2/8.1 MB 24.3 MB/s eta 0:00:01
   --------------------------------- ------ 6.9/8.1 MB 23.1 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 24.8 MB/s eta 0:00:00
Downloading contourpy-1.3.3-cp311-cp311-win_amd64.whl (225 kB)
   ---------------------------------------- 0.0/225.2 kB ? eta -:--:--
   ---------------------------------------- 225.2/225.2 kB ? eta 0:00:00
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.61.1-cp311-cp311-win_amd64.whl (2.3 MB)
   ---------------------------------------- 0.0/2.3 MB ? eta -:--:--
   ---------------------------------------- 2.3/2.3 MB 74.9 MB/s eta 0:00:00
Downloading kiwisolver-1.4.9-cp311-cp311-win_amd64.whl (73 kB)
   ---------------------------------------- 0.0/73.8 kB ? eta -:--:--
   ---------------------------------------- 73.8/73.8 kB 4.0 MB/s eta 0:00:00
Downloading pillow-12.1.0-cp311-cp311-win_amd64.whl (7.0 MB)
   ---------------------------------------- 0.0/7.0 MB ? eta -:--:--
   --------------------- ------------------ 3.7/7.0 MB 79.5 MB/s eta 0:00:01
   ---------------------------------------- 7.0/7.0 MB 90.0 MB/s eta 0:00:00
Downloading pyparsing-3.3.1-py3-none-any.whl (121 kB)
   ---------------------------------------- 0.0/121.8 kB ? eta -:--:--
   ---------------------------------------- 121.8/121.8 kB ? eta 0:00:00
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.3.3 cycler-0.12.1 fonttools-4.61.1 kiwisolver-1.4.9 matplotlib-3.10.8 pillow-12.1.0 pyparsing-3.3.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import matplotlib.pyplot as plt

plt.rc('font', family='Malgun Gothic')
plt.rc('axes', unicode_minus=False)

In [ ]:
plt.figure(figsize=(10, 5))
plt.plot([1, 2, 3], [10, 20, 15])
plt.title('간단한 플롯')
plt.show()

In [ ]:
# 선그래프 그리기
plt.rc('font', family='Malgun Gothic')
plt.rc('axes', unicode_minus=False)
 
pd.Series([-1,2,3]).plot(title='테스트', figsize=(3,2))

In [ ]:
plt.figure(figsize=(10, 5))
plt.plot([1, 2, 3], [10, 20, 15])
plt.title('간단한 플롯')
plt.show()

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd
 
# --- 데이터 생성---
data = {
    '월': pd.to_datetime(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01', '2025-05-01', '2025-06-01']),
    '방문자수': [1500, 1800, 1700, 2100, 2500, 2300]
}
df_line = pd.DataFrame(data)
 
plt.figure(figsize=(10, 6)) # figsize 설정
 
# 1. 플롯 그리기
plt.plot(
    df_line['월'],
    df_line['방문자수'],
    marker='o',
    linestyle='-',
    color='dodgerblue'
)
 
# 2. 그래프 꾸미기 (ax.set_ 대신 plt. 사용)
plt.title('2025년 상반기 월별 웹사이트 방문자 수', fontsize=16)
plt.xlabel('월', fontsize=12)
plt.ylabel('방문자 수 (명)', fontsize=12)
plt.grid(True, linestyle='--', alpha=0.6)
plt.show()

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd
 
data = {
    '부서': ['영업1팀', '영업2팀', '마케팅팀', '기술지원팀'],
    '실적(억원)': [12, 15, 8, 5]
}
df_bar = pd.DataFrame(data)
 
plt.figure(figsize=(10, 6))
 
bars = plt.bar(
    df_bar['부서'],
    df_bar['실적(억원)'],
    color=['#FF5733', '#33FF57', '#3357FF', '#FF33A1']
)
 
plt.title('2023년 3분기 부서별 판매 실적', fontsize=16)
plt.xlabel('부서', fontsize=12)
plt.ylabel('실적 (억원)', fontsize=12)
 
# 각 바 위에 실제 값 표시 (plt.text 사용)
for bar in bars:
    yval = bar.get_height()
    # plt.text(x좌표, y좌표, 내용, 정렬방식)
    plt.text(
        bar.get_x() + bar.get_width()/2.0,
        yval,
        f'{yval}억',
        va='bottom',
        ha='center'
    )
 
plt.show()

In [ ]:
import matplotlib.pyplot as plt
import numpy as np
 
np.random.seed(42)
advertising_cost = np.random.randint(10, 100, 50)
sales = advertising_cost * 1.5 + np.random.normal(0, 10, 50)
 
plt.figure(figsize=(10, 6))
plt.scatter(
    advertising_cost,
    sales,
    alpha=0.7,
    edgecolors='w',
    s=80
)


plt.title('광고비와 매출의 관계', fontsize=16)
plt.xlabel('광고비 (만원)', fontsize=12)
plt.ylabel('매출 (만원)', fontsize=12)
plt.grid(True, linestyle=':', alpha=0.6)
 
plt.show()

In [ ]:
import matplotlib.pyplot as plt
import numpy as np
 
np.random.seed(42)
advertising_cost = np.random.randint(10, 100, 50)
sales = advertising_cost * 1.5 + np.random.normal(0, 10, 50)
 
plt.scatter(
    advertising_cost,
    sales,
    c=sales,          # 매출 값에 따라 색상 부여
    cmap='viridis',   # 색상 지도 설정
    alpha=0.8,
    edgecolors='w',
    s=sales * 2       # 매출이 클수록 점도 크게
)
plt.colorbar(label='매출 규모') # 색상 막대 추가


plt.title('광고비와 매출의 관계', fontsize=16)
plt.xlabel('광고비 (만원)', fontsize=12)
plt.ylabel('매출 (만원)', fontsize=12)
plt.grid(True, linestyle=':', alpha=0.6)
 
plt.show()

### 히스토그램

In [ ]:
plt.hist()

In [ ]:
import matplotlib.pyplot as plt
import numpy as np
 
np.random.seed(0)
customer_ages = np.random.normal(loc=35, scale=10, size=200).astype(int)
 
plt.figure(figsize=(10, 6))
plt.hist(
    customer_ages,
    bins=15,
    color='skyblue',
    edgecolor='black'
)
 
plt.title('고객 연령 분포', fontsize=16)
plt.xlabel('나이', fontsize=12)
plt.ylabel('고객 수 (빈도)', fontsize=12)
 
plt.show()

### 히트맵

In [ ]:
# 추천은 아님
import matplotlib.pyplot as plt
import numpy as np
 
data = np.random.rand(8, 10)
rows = [f'Row{i+1}' for i in range(data.shape[0])]
cols = [f'Col{i+1}' for i in range(data.shape[1])]
 
plt.figure(figsize=(10, 7))
im = plt.imshow(data, cmap='coolwarm')
plt.colorbar(im)
plt.xticks(np.arange(data.shape[1]), labels=cols)
plt.yticks(np.arange(data.shape[0]), labels=rows)
plt.tick_params(top=True, bottom=False, labeltop=True, labelbottom=False)
plt.setp(plt.gca().get_xticklabels(), rotation=-30, ha="right", rotation_mode="anchor")
 
# 각 셀에 텍스트 추가 (Annotation)
for i in range(data.shape[0]):
    for j in range(data.shape[1]):
        # plt.text(x, y, s) 순서입니다.
        plt.text(j, i, f'{data[i, j]:.2f}',
                 ha="center", va="center", color="w")
 
plt.title("Heatmap using Matplotlib", pad=20)
plt.tight_layout()
plt.show()

### Seaborn

In [8]:
%pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from seaborn) (2.4.1)
Requirement already satisfied: pandas>=1.2 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from seaborn) (3.10.8)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.61.1)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.9)
Requirement already satisfied: packaging>=20.0 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Requirement already satisfied: pillow>=8 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (12.1.0)
Requirement already satisfied: pyparsing>=3 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.3.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\wjsrh\appdata\local\programs\python\python311\lib\site-packages (from pandas>=1.2->seaborn) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\wjsrh\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
   ---------------------------------------- 0.0/294.9 kB ? eta -:--:--
   ---- ----------------------------------- 30.7/294.9 kB ? eta -:--:--
   --------------------------- ------------ 204.8/294.9 kB 4.1 MB/s eta 0:00:01
   ---------------------------------------- 294.9/294.9 kB 4.6 MB/s eta 0:00:00
Installing collected packages: seaborn
Successfully installed seaborn-0.13.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import seaborn as sns

In [ ]:
sns.heatmap(data, annot=True, fmt=".2f", cmap='coolwarm', xticklabels=cols, yticklabels=rows)
plt.show()

In [ ]:
sns.barplot(x=['A', 'B'], y=[10, 20])
plt.title("Seaborn Plot with Matplotlib Title")
plt.show()

In [ ]:
tips = sns.load_dataset('tips')

In [ ]:
tips

In [ ]:
sns.scatterplot(data=tips, x="total_bill", y="tip", hue="smoker", s=100)
plt.title("총 결제금액과 팁의 관계 (흡연 여부별)")
plt.show()

In [ ]:
sns.scatterplot(data=tips, x="total_bill", y="tip", hue="time", s=100)
plt.title("총 결제금액과 팁의 관계 (흡연 여부별)")
plt.show()

In [ ]:
sns.scatterplot(data=tips, x="total_bill", y="tip", hue="day", s=100)
plt.title("총 결제금액과 팁의 관계 (흡연 여부별)")
plt.show()

In [ ]:
sns.scatterplot(data=tips, x="total_bill", y="tip", hue="sex", s=100)
plt.title("총 결제금액과 팁의 관계 (흡연 여부별)")
plt.show()

In [ ]:
import seaborn as sns

sns.set_theme(style="ticks", palette="pastel")
 
# Load the example tips dataset

tips = sns.load_dataset("tips")
 
# Draw a nested boxplot to show bills by day and time

sns.boxplot(x="day", y="total_bill",

            hue="smoker", palette=["m", "g"],

            data=tips)

sns.despine(offset=10, trim=True)

In [ ]:
import seaborn as sns

sns.set_theme(style="ticks")
 
df = sns.load_dataset("penguins")

sns.pairplot(df, hue="species")

In [302]:
# 미션 시각화
# 제품분류별 매출 비중(Bar Chart) - 어떤 카테고리가 가장 수익이 높은지
# 고객등급별 구매금액 분포 (Box Plot) - VIP와 일반 고객의 구매 단가 차이 확인
# 일자별 매출 추이 (Line Plot) - 시간의 흐름에 따라 매출이 어떻게 변하는지
# 지역별 온라인 주문의 비중

merged_df = pd.read_csv('sales_data.csv')

In [303]:
merged_df['총구매금액'] = merged_df.groupby('고객명')['구매금액'].transform('sum')

KeyError: '고객명'